12 12 <12>
11 11 <11>
10 10 <10>
9 9 <9>
8 8 <8>
7 7 <7>
6 6 <6>
5 5 <5>
4 4 <4>
3 3 <3>
2 2 <2>
0 1 <1>
7 05 <time>
{---------------------------------1----------------------------------}
1) Отметьте тег, которым задается таблица:
&
*<table>
<tr>
<td>
<th>
<tt>
&
{---------------------------------2----------------------------------}
2) Отметьте тег, которым задается строка таблицы:
&
<table>
*<tr>
<td>
<th>
<tt>
&
{---------------------------------3----------------------------------}
3) Отметьте тег, которым задается заголовочная ячейка таблицы:
&
<table>
<tr>
*<th>
<td>
<tt>
&
{---------------------------------4----------------------------------}
4) Отметьте тег, которым задается обычная ячейка таблицы:
&
<table>
<tr>
*<td>
<th>
<tt>
& 
{---------------------------------5----------------------------------}
5) Какой тег позволит разместить таблицу по центру страницы?
&
*<table align="center"> 
<table center> 
<table align="justify"> 
<td align="center"> 
<tr align="center"> 
&
{---------------------------------6-----------------------------------}
6) Для таблицы можно задать фоновое изображение с помощью:
&
атрибута face
атрибута bgcolor 
атрибута bordercolor  
тега <img src="fon.jpg">
*атрибута background
&
{---------------------------------7-----------------------------------}
7) Выровнять элементы ячейки таблицы по вертикали можно так:
&
*<td valign="top">
<td align="center">
<table valign="top">
<td valign="left">
<td align="top">
&
{---------------------------------8-----------------------------------}
8) Выровнять элементы ячейки таблицы по горизонтали можно так:
&
<td valign="top">
*<td align="center">
<table align="top">
<td valign="left">
<td align="top">
&
{---------------------------------9-----------------------------------}
9) Расстояние 5 пикселей между ячейками таблицы можно задать так:
&
width="5"
сellpadding="5"
*сellspacing="5"
сellspacing="5%"
colspan="5"
&
{---------------------------------10----------------------------------}
10) Расстояние 5 пикселей от рамки таблицы до текста в ячейке можно задать так:
&
border="5"
*сellpadding="5"
сellspacing="5"
rowspan="5"
colspan="5"
&
{---------------------------------11----------------------------------}
11) Объединить пять ячеек таблицы по горизонтали можно так:
&
width="5"
сellpadding="5"
сellspacing="5"
rowspan="5"
*colspan="5"
&
{---------------------------------12----------------------------------}
12)Задать красный цвет границе таблицы можно так:
&
border="red"
*bordercolor="red"
bgcolor="red"
color="red"
framecolor="red"
&